TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_spgss.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_spgss__include
#define ti_devices_msp_peripherals_hw_spgss__include

/* Filename: hw_spgss.h */
/* Revised: 2024-07-09 09:23:19 */
/* Revision: 3060da33b0a30a38b851efb52ec3edd92cebbf75 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* SPGSS Registers
******************************************************************************/
#define SPGSS_I2C_PAIR_OFS                       ((uint32_t)0x000011C0U)
#define SPGSS_UNICOMM_LPBK_OFS                   ((uint32_t)0x00001120U)
#define SPGSS_DMA_CHAIN_OFS                      ((uint32_t)0x00001100U)
#define SPGSS_DMA_CHAIN1_OFS                     ((uint32_t)0x00001080U)
#define SPGSS_DMA_CHAIN0_OFS                     ((uint32_t)0x00001050U)
#define SPGSS_CPU_INT_OFS                        ((uint32_t)0x00001020U)


/** @addtogroup SPGSS_I2C_PAIR
  @{
*/

typedef struct {
  __IO uint32_t PAIR0;                             /* !< (@ 0x000011C0) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR1;                             /* !< (@ 0x000011C4) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR2;                             /* !< (@ 0x000011C8) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR3;                             /* !< (@ 0x000011CC) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR4;                             /* !< (@ 0x000011D0) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR5;                             /* !< (@ 0x000011D4) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR6;                             /* !< (@ 0x000011D8) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR7;                             /* !< (@ 0x000011DC) Pairing of I2C for MULTI-MASTER/SMBUS applications */
} SPGSS_I2C_PAIR_Regs;

/*@}*/ /* end of group SPGSS_I2C_PAIR */

/** @addtogroup SPGSS_UNICOMM_LPBK
  @{
*/

typedef struct {
  __IO uint32_t LPBK0;                             /* !< (@ 0x00001120) Loopback between SPG instances  User has to ensure
                                                      that the SPGs looped back have the same underlying IP instantiated;
                                                      i.e. both UART, both SPI, both I2C, etc., */
  __IO uint32_t LPBK1;                             /* !< (@ 0x00001124) Loopback between SPG instances  User has to ensure
                                                      that the SPGs looped back have the same underlying IP instantiated;
                                                      i.e. both UART, both SPI, both I2C, etc., */
} SPGSS_UNICOMM_LPBK_Regs;

/*@}*/ /* end of group SPGSS_UNICOMM_LPBK */

/** @addtogroup SPGSS_DMA_CHAIN
  @{
*/

typedef struct {
  __IO uint32_t DMACHAIN0;                         /* !< (@ 0x00001100) Select SPG FIFO for system DMA chaining */
  __IO uint32_t DMACHAIN1;                         /* !< (@ 0x00001104) Select SPG FIFO for system DMA chaining */
} SPGSS_DMA_CHAIN_Regs;

/*@}*/ /* end of group SPGSS_DMA_CHAIN */

/** @addtogroup SPGSS_DMA_CHAIN1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) Masked interrupt status */
       uint32_t RESERVED3[3];
  __O  uint32_t ICLR;                              /* !< (@ 0x000010A8) Interrupt clear */
} SPGSS_DMA_CHAIN1_Regs;

/*@}*/ /* end of group SPGSS_DMA_CHAIN1 */

/** @addtogroup SPGSS_DMA_CHAIN0
  @{
*/

