TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_spgss.h
typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3[3];
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear */
} SPGSS_DMA_CHAIN0_Regs;

/*@}*/ /* end of group SPGSS_DMA_CHAIN0 */

/** @addtogroup SPGSS_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} SPGSS_CPU_INT_Regs;

/*@}*/ /* end of group SPGSS_CPU_INT */

/** @addtogroup SPGSS
  @{
*/

typedef struct {
       uint32_t RESERVED0[1032];
  SPGSS_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED1;
  SPGSS_DMA_CHAIN0_Regs  DMA_CHAIN0;                        /* !< (@ 0x00001050) */
       uint32_t RESERVED2;
  SPGSS_DMA_CHAIN1_Regs  DMA_CHAIN1;                        /* !< (@ 0x00001080) */
       uint32_t RESERVED3[21];
  SPGSS_DMA_CHAIN_Regs  DMA_CHAIN;                         /* !< (@ 0x00001100) */
       uint32_t RESERVED4[6];
  SPGSS_UNICOMM_LPBK_Regs  UNICOMM_LPBK;                      /* !< (@ 0x00001120) */
       uint32_t RESERVED5[38];
  SPGSS_I2C_PAIR_Regs  I2C_PAIR;                          /* !< (@ 0x000011C0) */
} SPGSS_Regs;

/*@}*/ /* end of group SPGSS */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* SPGSS Register Control Bits
******************************************************************************/

/* SPGSS_PAIR0 Bits */
/* SPGSS_PAIR0[CTL] Bits */
#define SPGSS_PAIR0_CTL_OFS                      (8)                             /* !< CTL Offset */
#define SPGSS_PAIR0_CTL_MASK                     ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define SPGSS_PAIR0_CTL_SPG1                     ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG2                     ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG3                     ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG4                     ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG5                     ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG6                     ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG7                     ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG8                     ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG9                     ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG10                    ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG11                    ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG12                    ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG13                    ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG14                    ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG15                    ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR0_CTL_SPG16                    ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* SPGSS_PAIR0[TARGET] Bits */
#define SPGSS_PAIR0_TARGET_OFS                   (12)                            /* !< TARGET Offset */
#define SPGSS_PAIR0_TARGET_MASK                  ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define SPGSS_PAIR0_TARGET_SPG1                  ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG2                  ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG3                  ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG4                  ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG5                  ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG6                  ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG7                  ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG8                  ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG9                  ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG10                 ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG11                 ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG12                 ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG13                 ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG14                 ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG15                 ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR0_TARGET_SPG16                 ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* SPGSS_PAIR0[EN] Bits */
#define SPGSS_PAIR0_EN_OFS                       (0)                             /* !< EN Offset */
#define SPGSS_PAIR0_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Enable */
#define SPGSS_PAIR0_EN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_PAIR0_EN_ENABLE                    ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

/* SPGSS_PAIR1 Bits */
/* SPGSS_PAIR1[CTL] Bits */
#define SPGSS_PAIR1_CTL_OFS                      (8)                             /* !< CTL Offset */
#define SPGSS_PAIR1_CTL_MASK                     ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define SPGSS_PAIR1_CTL_SPG1                     ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG2                     ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG3                     ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG4                     ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG5                     ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG6                     ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG7                     ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG8                     ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG9                     ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG10                    ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG11                    ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG12                    ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG13                    ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG14                    ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG15                    ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR1_CTL_SPG16                    ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* SPGSS_PAIR1[TARGET] Bits */
#define SPGSS_PAIR1_TARGET_OFS                   (12)                            /* !< TARGET Offset */
#define SPGSS_PAIR1_TARGET_MASK                  ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define SPGSS_PAIR1_TARGET_SPG1                  ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG2                  ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG3                  ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG4                  ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG5                  ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG6                  ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG7                  ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG8                  ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG9                  ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG10                 ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG11                 ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG12                 ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG13                 ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG14                 ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG15                 ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR1_TARGET_SPG16                 ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* SPGSS_PAIR1[EN] Bits */
#define SPGSS_PAIR1_EN_OFS                       (0)                             /* !< EN Offset */
#define SPGSS_PAIR1_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Enable */
#define SPGSS_PAIR1_EN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_PAIR1_EN_ENABLE                    ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

