TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_spgss.h
/* SPGSS_PAIR2 Bits */
/* SPGSS_PAIR2[CTL] Bits */
#define SPGSS_PAIR2_CTL_OFS                      (8)                             /* !< CTL Offset */
#define SPGSS_PAIR2_CTL_MASK                     ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define SPGSS_PAIR2_CTL_SPG1                     ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG2                     ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG3                     ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG4                     ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG5                     ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG6                     ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG7                     ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG8                     ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG9                     ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG10                    ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG11                    ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG12                    ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG13                    ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG14                    ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG15                    ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR2_CTL_SPG16                    ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* SPGSS_PAIR2[TARGET] Bits */
#define SPGSS_PAIR2_TARGET_OFS                   (12)                            /* !< TARGET Offset */
#define SPGSS_PAIR2_TARGET_MASK                  ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define SPGSS_PAIR2_TARGET_SPG1                  ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG2                  ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG3                  ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG4                  ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG5                  ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG6                  ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG7                  ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG8                  ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG9                  ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG10                 ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG11                 ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG12                 ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG13                 ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG14                 ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG15                 ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR2_TARGET_SPG16                 ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* SPGSS_PAIR2[EN] Bits */
#define SPGSS_PAIR2_EN_OFS                       (0)                             /* !< EN Offset */
#define SPGSS_PAIR2_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Enable */
#define SPGSS_PAIR2_EN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_PAIR2_EN_ENABLE                    ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

/* SPGSS_PAIR3 Bits */
/* SPGSS_PAIR3[CTL] Bits */
#define SPGSS_PAIR3_CTL_OFS                      (8)                             /* !< CTL Offset */
#define SPGSS_PAIR3_CTL_MASK                     ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define SPGSS_PAIR3_CTL_SPG1                     ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG2                     ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG3                     ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG4                     ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG5                     ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG6                     ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG7                     ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG8                     ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG9                     ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG10                    ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG11                    ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG12                    ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG13                    ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG14                    ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG15                    ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR3_CTL_SPG16                    ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* SPGSS_PAIR3[TARGET] Bits */
#define SPGSS_PAIR3_TARGET_OFS                   (12)                            /* !< TARGET Offset */
#define SPGSS_PAIR3_TARGET_MASK                  ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define SPGSS_PAIR3_TARGET_SPG1                  ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG2                  ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG3                  ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG4                  ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG5                  ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG6                  ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG7                  ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG8                  ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG9                  ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG10                 ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG11                 ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG12                 ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG13                 ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG14                 ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG15                 ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR3_TARGET_SPG16                 ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* SPGSS_PAIR3[EN] Bits */
#define SPGSS_PAIR3_EN_OFS                       (0)                             /* !< EN Offset */
#define SPGSS_PAIR3_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Enable */
#define SPGSS_PAIR3_EN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_PAIR3_EN_ENABLE                    ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

/* SPGSS_PAIR4 Bits */
/* SPGSS_PAIR4[CTL] Bits */
#define SPGSS_PAIR4_CTL_OFS                      (8)                             /* !< CTL Offset */
#define SPGSS_PAIR4_CTL_MASK                     ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define SPGSS_PAIR4_CTL_SPG1                     ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG2                     ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG3                     ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG4                     ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG5                     ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG6                     ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG7                     ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG8                     ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG9                     ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG10                    ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG11                    ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG12                    ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG13                    ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG14                    ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG15                    ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR4_CTL_SPG16                    ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* SPGSS_PAIR4[TARGET] Bits */
#define SPGSS_PAIR4_TARGET_OFS                   (12)                            /* !< TARGET Offset */
#define SPGSS_PAIR4_TARGET_MASK                  ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define SPGSS_PAIR4_TARGET_SPG1                  ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG2                  ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG3                  ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG4                  ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG5                  ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG6                  ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG7                  ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG8                  ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG9                  ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG10                 ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG11                 ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG12                 ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG13                 ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG14                 ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG15                 ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR4_TARGET_SPG16                 ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* SPGSS_PAIR4[EN] Bits */
#define SPGSS_PAIR4_EN_OFS                       (0)                             /* !< EN Offset */
#define SPGSS_PAIR4_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Enable */
#define SPGSS_PAIR4_EN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_PAIR4_EN_ENABLE                    ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

/* SPGSS_PAIR5 Bits */
/* SPGSS_PAIR5[CTL] Bits */
#define SPGSS_PAIR5_CTL_OFS                      (8)                             /* !< CTL Offset */
#define SPGSS_PAIR5_CTL_MASK                     ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define SPGSS_PAIR5_CTL_SPG1                     ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG2                     ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG3                     ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG4                     ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG5                     ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG6                     ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG7                     ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG8                     ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG9                     ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG10                    ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG11                    ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG12                    ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG13                    ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG14                    ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG15                    ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define SPGSS_PAIR5_CTL_SPG16                    ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* SPGSS_PAIR5[TARGET] Bits */
#define SPGSS_PAIR5_TARGET_OFS                   (12)                            /* !< TARGET Offset */
#define SPGSS_PAIR5_TARGET_MASK                  ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define SPGSS_PAIR5_TARGET_SPG1                  ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG2                  ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG3                  ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG4                  ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG5                  ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG6                  ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG7                  ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG8                  ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG9                  ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG10                 ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG11                 ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG12                 ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG13                 ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG14                 ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG15                 ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define SPGSS_PAIR5_TARGET_SPG16                 ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* SPGSS_PAIR5[EN] Bits */
#define SPGSS_PAIR5_EN_OFS                       (0)                             /* !< EN Offset */
#define SPGSS_PAIR5_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Enable */
#define SPGSS_PAIR5_EN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_PAIR5_EN_ENABLE                    ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

