TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_spgss.h
/* SPGSS_DMA_CHAIN1_RIS Bits */
/* SPGSS_DMA_CHAIN1_RIS[DMA_DONE_CHAIN1] Bits */
#define SPGSS_DMA_CHAIN1_RIS_DMA_DONE_CHAIN1_OFS (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_DMA_CHAIN1_RIS_DMA_DONE_CHAIN1_MASK ((uint32_t)0x00000002U)         /* !< DMA Done Chain 1 */
#define SPGSS_DMA_CHAIN1_RIS_DMA_DONE_CHAIN1_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_DMA_CHAIN1_RIS_DMA_DONE_CHAIN1_SET ((uint32_t)0x00000002U)         /* !< Interrupt occurred */

/* SPGSS_DMA_CHAIN1_MIS Bits */
/* SPGSS_DMA_CHAIN1_MIS[DMA_DONE_CHAIN1] Bits */
#define SPGSS_DMA_CHAIN1_MIS_DMA_DONE_CHAIN1_OFS (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_DMA_CHAIN1_MIS_DMA_DONE_CHAIN1_MASK ((uint32_t)0x00000002U)         /* !< Masked DMA_DONE_CHAIN1 */
#define SPGSS_DMA_CHAIN1_MIS_DMA_DONE_CHAIN1_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_DMA_CHAIN1_MIS_DMA_DONE_CHAIN1_SET ((uint32_t)0x00000002U)         /* !< Interrupt occurred */

/* SPGSS_DMA_CHAIN1_ICLR Bits */
/* SPGSS_DMA_CHAIN1_ICLR[DMA_DONE_CHAIN1] Bits */
#define SPGSS_DMA_CHAIN1_ICLR_DMA_DONE_CHAIN1_OFS (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_DMA_CHAIN1_ICLR_DMA_DONE_CHAIN1_MASK ((uint32_t)0x00000002U)         /* !< DMA DONE CHAIN1 */
#define SPGSS_DMA_CHAIN1_ICLR_DMA_DONE_CHAIN1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SPGSS_DMA_CHAIN1_ICLR_DMA_DONE_CHAIN1_CLR ((uint32_t)0x00000002U)         /* !< Clear Interrupt */

/* SPGSS_DMA_CHAIN0_IMASK Bits */
/* SPGSS_DMA_CHAIN0_IMASK[DMA_DONE_CHAIN0] Bits */
#define SPGSS_DMA_CHAIN0_IMASK_DMA_DONE_CHAIN0_OFS (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_DMA_CHAIN0_IMASK_DMA_DONE_CHAIN0_MASK ((uint32_t)0x00000001U)         /* !< DMA Done Chain0 */
#define SPGSS_DMA_CHAIN0_IMASK_DMA_DONE_CHAIN0_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define SPGSS_DMA_CHAIN0_IMASK_DMA_DONE_CHAIN0_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */

/* SPGSS_DMA_CHAIN0_RIS Bits */
/* SPGSS_DMA_CHAIN0_RIS[DMA_DONE_CHAIN0] Bits */
#define SPGSS_DMA_CHAIN0_RIS_DMA_DONE_CHAIN0_OFS (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_DMA_CHAIN0_RIS_DMA_DONE_CHAIN0_MASK ((uint32_t)0x00000001U)         /* !< DMA Done Chain 0 */
#define SPGSS_DMA_CHAIN0_RIS_DMA_DONE_CHAIN0_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_DMA_CHAIN0_RIS_DMA_DONE_CHAIN0_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* SPGSS_DMA_CHAIN0_MIS Bits */
/* SPGSS_DMA_CHAIN0_MIS[DMA_DONE_CHAIN0] Bits */
#define SPGSS_DMA_CHAIN0_MIS_DMA_DONE_CHAIN0_OFS (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_DMA_CHAIN0_MIS_DMA_DONE_CHAIN0_MASK ((uint32_t)0x00000001U)         /* !< Masked DMA_DONE_CHAIN0 */
#define SPGSS_DMA_CHAIN0_MIS_DMA_DONE_CHAIN0_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_DMA_CHAIN0_MIS_DMA_DONE_CHAIN0_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* SPGSS_DMA_CHAIN0_ICLR Bits */
/* SPGSS_DMA_CHAIN0_ICLR[DMA_DONE_CHAIN0] Bits */
#define SPGSS_DMA_CHAIN0_ICLR_DMA_DONE_CHAIN0_OFS (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_DMA_CHAIN0_ICLR_DMA_DONE_CHAIN0_MASK ((uint32_t)0x00000001U)         /* !< DMA DONE CHAIN0 */
#define SPGSS_DMA_CHAIN0_ICLR_DMA_DONE_CHAIN0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SPGSS_DMA_CHAIN0_ICLR_DMA_DONE_CHAIN0_CLR ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* SPGSS_IIDX Bits */
/* SPGSS_IIDX[STAT] Bits */
#define SPGSS_IIDX_STAT_OFS                      (0)                             /* !< STAT Offset */
#define SPGSS_IIDX_STAT_MASK                     ((uint32_t)0x000000FFU)         /* !< UART Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define SPGSS_IIDX_STAT_NO_INTR                  ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define SPGSS_IIDX_STAT_DMA_DONE_CHAIN0          ((uint32_t)0x00000001U)         /* !< DMA_DONE_CHAIN0 */
#define SPGSS_IIDX_STAT_DMA_DONE_CHAIN1          ((uint32_t)0x00000002U)         /* !< DMA DONE CHAIN1 */

/* SPGSS_CPU_INT_IMASK Bits */
/* SPGSS_CPU_INT_IMASK[DMA_DONE_CHAIN0] Bits */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN0_OFS  (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN0_MASK ((uint32_t)0x00000001U)         /* !< DMA Done Chain0 */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN0_CLR  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN0_SET  ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* SPGSS_CPU_INT_IMASK[DMA_DONE_CHAIN1] Bits */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN1_OFS  (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN1_MASK ((uint32_t)0x00000002U)         /* !< DMA Done Chain1 */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN1_CLR  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define SPGSS_CPU_INT_IMASK_DMA_DONE_CHAIN1_SET  ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */

/* SPGSS_CPU_INT_RIS Bits */
/* SPGSS_CPU_INT_RIS[DMA_DONE_CHAIN0] Bits */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN0_OFS    (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN0_MASK   ((uint32_t)0x00000001U)         /* !< DMA Done Chain 0 */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN0_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN0_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* SPGSS_CPU_INT_RIS[DMA_DONE_CHAIN1] Bits */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN1_OFS    (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN1_MASK   ((uint32_t)0x00000002U)         /* !< DMA Done Chain 1 */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN1_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_CPU_INT_RIS_DMA_DONE_CHAIN1_SET    ((uint32_t)0x00000002U)         /* !< Interrupt occurred */

/* SPGSS_CPU_INT_MIS Bits */
/* SPGSS_CPU_INT_MIS[DMA_DONE_CHAIN0] Bits */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN0_OFS    (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN0_MASK   ((uint32_t)0x00000001U)         /* !< Masked DMA_DONE_CHAIN0 */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN0_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN0_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* SPGSS_CPU_INT_MIS[DMA_DONE_CHAIN1] Bits */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN1_OFS    (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN1_MASK   ((uint32_t)0x00000002U)         /* !< Masked DMA_DONE_CHAIN1 */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN1_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define SPGSS_CPU_INT_MIS_DMA_DONE_CHAIN1_SET    ((uint32_t)0x00000002U)         /* !< Interrupt occurred */

/* SPGSS_ISET Bits */
/* SPGSS_ISET[DMA_DONE_CHAIN0] Bits */
#define SPGSS_ISET_DMA_DONE_CHAIN0_OFS           (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_ISET_DMA_DONE_CHAIN0_MASK          ((uint32_t)0x00000001U)         /* !< DMA_DONE_CHAIN0 */
#define SPGSS_ISET_DMA_DONE_CHAIN0_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SPGSS_ISET_DMA_DONE_CHAIN0_SET           ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* SPGSS_ISET[DMA_DONE_CHAIN1] Bits */
#define SPGSS_ISET_DMA_DONE_CHAIN1_OFS           (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_ISET_DMA_DONE_CHAIN1_MASK          ((uint32_t)0x00000002U)         /* !< DMA_DONE_CHAIN1 */
#define SPGSS_ISET_DMA_DONE_CHAIN1_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SPGSS_ISET_DMA_DONE_CHAIN1_SET           ((uint32_t)0x00000002U)         /* !< Set Interrupt */

/* SPGSS_CPU_INT_ICLR Bits */
/* SPGSS_CPU_INT_ICLR[DMA_DONE_CHAIN0] Bits */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN0_OFS   (0)                             /* !< DMA_DONE_CHAIN0 Offset */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN0_MASK  ((uint32_t)0x00000001U)         /* !< DMA DONE CHAIN0 */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN0_CLR   ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* SPGSS_CPU_INT_ICLR[DMA_DONE_CHAIN1] Bits */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN1_OFS   (1)                             /* !< DMA_DONE_CHAIN1 Offset */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN1_MASK  ((uint32_t)0x00000002U)         /* !< DMA DONE CHAIN1 */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define SPGSS_CPU_INT_ICLR_DMA_DONE_CHAIN1_CLR   ((uint32_t)0x00000002U)         /* !< Clear Interrupt */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_spgss__include */

